Revit 2027 API
EndTreatmentType.CreateDefaultEndTreatmentType Method
 Creates a new EndTreatmentType object with a default name.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId CreateDefaultEndTreatmentType(
	Document ADoc
)
Public Shared Function CreateDefaultEndTreatmentType (
	ADoc As Document
) As ElementId
public:
static ElementId^ CreateDefaultEndTreatmentType(
	Document^ ADoc
)
static member CreateDefaultEndTreatmentType :
        ADoc : Document -> ElementId
Parameters
ADoc Document
 The document.
Return Value
ElementId
 The newly created type id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EndTreatmentType Class
Autodesk.Revit.DB.Structure Namespace